{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__dtype__": "0"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_middle_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 7, 7)", 
        "no_bias": "True", 
        "num_filter": "45", 
        "pad": "(0, 3, 3)", 
        "stride": "(1, 2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_middle", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 7, 7)", 
        "no_bias": "True", 
        "num_filter": "45", 
        "pad": "(0, 3, 3)", 
        "stride": "(1, 2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_middle_spatbn_relu_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_middle_spatbn_relu_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_middle_spatbn_relu_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_middle_spatbn_relu_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_middle_spatbn_relu", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0, 0)", 
        "stride": "(1, 1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_spatbn_relu_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_spatbn_relu_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_spatbn_relu_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_spatbn_relu_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1_spatbn_relu", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_0_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_0_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_expansion_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_0_spatbn_expansion", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_0_conv_depth_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_conv_depth_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_0_conv_depth", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_depth_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_depth_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_depth_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_depth_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_0_spatbn_depth", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 1], [32, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_0_conv_projection_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_conv_projection_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_0_conv_projection", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_projection_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_projection_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_projection_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_0_spatbn_projection_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_0_spatbn_projection", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 1], [41, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "comp_1_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_1_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_expansion_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_1_spatbn_expansion", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0], [48, 0, 1], [49, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_1_conv_depth_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_conv_depth_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_1_conv_depth", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_depth_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_depth_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_depth_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_depth_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_1_spatbn_depth", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 1], [58, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_1_conv_projection_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_conv_projection_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_1_conv_projection", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_projection_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_projection_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_projection_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_1_spatbn_projection_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_1_spatbn_projection", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0], [65, 0, 0], [66, 0, 1], [67, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[68, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_2_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_2_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_expansion_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_2_spatbn_expansion", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0], [74, 0, 0], [75, 0, 1], [76, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_2_conv_depth_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_conv_depth_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_2_conv_depth", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_depth_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_depth_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_depth_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_depth_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_2_spatbn_depth", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0], [84, 0, 1], [85, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_2_conv_projection_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_conv_projection_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_2_conv_projection", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_projection_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_projection_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_projection_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_2_spatbn_projection_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_2_spatbn_projection", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[95, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_3_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_3_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_expansion_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_3_spatbn_expansion", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0], [102, 0, 1], [103, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_3_conv_depth_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_conv_depth_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_3_conv_depth", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_depth_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_depth_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_depth_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_depth_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_3_spatbn_depth", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 1], [112, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_3_conv_projection_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_conv_projection_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_3_conv_projection", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_projection_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_projection_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_projection_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_3_spatbn_projection_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_3_spatbn_projection", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0], [119, 0, 0], [120, 0, 1], [121, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[122, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_4_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_4_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_expansion_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_4_spatbn_expansion", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 1], [130, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_4_conv_depth_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[2, 2, 2]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_conv_depth_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[2, 2, 2]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_4_conv_depth", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "144", 
        "num_group": "144", 
        "pad": "(1, 1, 1)", 
        "stride": "[2, 2, 2]", 
        "workspace": "512"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_depth_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_depth_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_depth_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_depth_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_4_spatbn_depth", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 1], [139, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_4_conv_projection_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_conv_projection_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_4_conv_projection", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_projection_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_projection_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_projection_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_4_spatbn_projection_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_4_spatbn_projection", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "comp_5_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_5_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_expansion_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_5_spatbn_expansion", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[152, 0, 0], [153, 0, 0], [154, 0, 0], [155, 0, 1], [156, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_5_conv_depth_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "288", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_conv_depth_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "288", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_5_conv_depth", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 3, 3)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "288", 
        "pad": "(1, 1, 1)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_depth_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_depth_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_depth_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_depth_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_5_spatbn_depth", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_5_conv_projection_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_conv_projection_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_5_conv_projection", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(1, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_projection_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_projection_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_projection_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_5_spatbn_projection_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "comp_5_spatbn_projection", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0], [173, 0, 1], [174, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[175, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_6_conv_expansion_weight", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_6_conv_expansion_bias", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "comp_6_conv_expansion", 
      "attrs": {
        "cudnn_tune": "fastest", 
        "kernel": "(3, 1, 1)", 
        "no_bias": "False", 
        "num_filter": "288", 
        "num_group": "1", 
        "pad": "(1, 0, 0)", 
        "stride": "[1, 1, 1]", 
        "workspace": "512"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "comp_6_spatbn_expansion_gamma", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_6_spatbn_expansion_beta", 
      "attrs": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "comp_6_spatbn_expansion_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
